benchmarks/results/2026-07-01T03-18-36Z-spike.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 60 looping VUs for 50s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/60 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 01/60 VUs  00.3s/50.0s

running (0m02.0s), 01/60 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 01/60 VUs  01.3s/50.0s

running (0m03.0s), 01/60 VUs, 48 complete and 0 interrupted iterations
default   [   5% ] 01/60 VUs  02.3s/50.0s

running (0m04.0s), 02/60 VUs, 80 complete and 0 interrupted iterations
default   [   7% ] 02/60 VUs  03.3s/50.0s

running (0m05.0s), 02/60 VUs, 116 complete and 0 interrupted iterations
default   [   9% ] 02/60 VUs  04.3s/50.0s

running (0m06.0s), 03/60 VUs, 147 complete and 0 interrupted iterations
default   [  11% ] 03/60 VUs  05.3s/50.0s

running (0m07.0s), 03/60 VUs, 181 complete and 0 interrupted iterations
default   [  13% ] 03/60 VUs  06.3s/50.0s

running (0m08.0s), 03/60 VUs, 217 complete and 0 interrupted iterations
default   [  15% ] 03/60 VUs  07.3s/50.0s

running (0m09.0s), 04/60 VUs, 253 complete and 0 interrupted iterations
default   [  17% ] 04/60 VUs  08.3s/50.0s

running (0m10.0s), 04/60 VUs, 259 complete and 0 interrupted iterations
default   [  19% ] 04/60 VUs  09.3s/50.0s

running (0m11.0s), 06/60 VUs, 286 complete and 0 interrupted iterations
default   [  21% ] 06/60 VUs  10.3s/50.0s

running (0m12.0s), 12/60 VUs, 321 complete and 0 interrupted iterations
default   [  23% ] 12/60 VUs  11.3s/50.0s

running (0m13.0s), 17/60 VUs, 357 complete and 0 interrupted iterations
default   [  25% ] 17/60 VUs  12.3s/50.0s

running (0m14.0s), 23/60 VUs, 391 complete and 0 interrupted iterations
default   [  27% ] 23/60 VUs  13.3s/50.0s

running (0m15.0s), 28/60 VUs, 426 complete and 0 interrupted iterations
default   [  29% ] 28/60 VUs  14.3s/50.0s

running (0m16.0s), 34/60 VUs, 459 complete and 0 interrupted iterations
default   [  31% ] 34/60 VUs  15.3s/50.0s

running (0m17.0s), 39/60 VUs, 492 complete and 0 interrupted iterations
default   [  33% ] 39/60 VUs  16.3s/50.0s

running (0m18.0s), 45/60 VUs, 528 complete and 0 interrupted iterations
default   [  35% ] 45/60 VUs  17.3s/50.0s

running (0m19.0s), 50/60 VUs, 567 complete and 0 interrupted iterations
default   [  37% ] 50/60 VUs  18.3s/50.0s

running (0m20.0s), 56/60 VUs, 603 complete and 0 interrupted iterations
default   [  39% ] 56/60 VUs  19.3s/50.0s

running (0m21.0s), 60/60 VUs, 636 complete and 0 interrupted iterations
default   [  41% ] 60/60 VUs  20.3s/50.0s

running (0m22.0s), 60/60 VUs, 671 complete and 0 interrupted iterations
default   [  43% ] 60/60 VUs  21.3s/50.0s

running (0m23.0s), 60/60 VUs, 707 complete and 0 interrupted iterations
default   [  45% ] 60/60 VUs  22.3s/50.0s

running (0m24.0s), 60/60 VUs, 740 complete and 0 interrupted iterations
default   [  47% ] 60/60 VUs  23.3s/50.0s

running (0m25.0s), 60/60 VUs, 779 complete and 0 interrupted iterations
default   [  49% ] 60/60 VUs  24.3s/50.0s

running (0m26.0s), 60/60 VUs, 812 complete and 0 interrupted iterations
default   [  51% ] 60/60 VUs  25.3s/50.0s

running (0m27.0s), 60/60 VUs, 851 complete and 0 interrupted iterations
default   [  53% ] 60/60 VUs  26.3s/50.0s

running (0m28.0s), 60/60 VUs, 887 complete and 0 interrupted iterations
default   [  55% ] 60/60 VUs  27.3s/50.0s

running (0m29.0s), 60/60 VUs, 926 complete and 0 interrupted iterations
default   [  57% ] 60/60 VUs  28.3s/50.0s

running (0m30.0s), 60/60 VUs, 962 complete and 0 interrupted iterations
default   [  59% ] 60/60 VUs  29.3s/50.0s

running (0m31.0s), 60/60 VUs, 998 complete and 0 interrupted iterations
default   [  61% ] 60/60 VUs  30.3s/50.0s

running (0m32.0s), 60/60 VUs, 1034 complete and 0 interrupted iterations
default   [  63% ] 60/60 VUs  31.3s/50.0s

running (0m33.0s), 60/60 VUs, 1070 complete and 0 interrupted iterations
default   [  65% ] 60/60 VUs  32.3s/50.0s

running (0m34.0s), 60/60 VUs, 1106 complete and 0 interrupted iterations
default   [  67% ] 60/60 VUs  33.3s/50.0s

running (0m35.0s), 60/60 VUs, 1145 complete and 0 interrupted iterations
default   [  69% ] 60/60 VUs  34.3s/50.0s

running (0m36.0s), 60/60 VUs, 1180 complete and 0 interrupted iterations
default   [  71% ] 60/60 VUs  35.3s/50.0s

running (0m37.0s), 60/60 VUs, 1215 complete and 0 interrupted iterations
default   [  73% ] 60/60 VUs  36.3s/50.0s

running (0m38.0s), 60/60 VUs, 1254 complete and 0 interrupted iterations
default   [  75% ] 60/60 VUs  37.3s/50.0s

running (0m39.0s), 60/60 VUs, 1293 complete and 0 interrupted iterations
default   [  77% ] 60/60 VUs  38.3s/50.0s

running (0m40.0s), 60/60 VUs, 1331 complete and 0 interrupted iterations
default   [  79% ] 60/60 VUs  39.3s/50.0s

running (0m41.0s), 60/60 VUs, 1369 complete and 0 interrupted iterations
default   [  81% ] 60/60 VUs  40.3s/50.0s

running (0m42.0s), 57/60 VUs, 1408 complete and 0 interrupted iterations
default   [  83% ] 57/60 VUs  41.3s/50.0s

running (0m43.0s), 51/60 VUs, 1444 complete and 0 interrupted iterations
default   [  85% ] 51/60 VUs  42.3s/50.0s

running (0m44.0s), 44/60 VUs, 1486 complete and 0 interrupted iterations
default   [  87% ] 44/60 VUs  43.3s/50.0s

running (0m45.0s), 38/60 VUs, 1525 complete and 0 interrupted iterations
default   [  89% ] 38/60 VUs  44.3s/50.0s

running (0m46.0s), 31/60 VUs, 1560 complete and 0 interrupted iterations
default   [  91% ] 31/60 VUs  45.3s/50.0s

running (0m47.0s), 25/60 VUs, 1595 complete and 0 interrupted iterations
default   [  93% ] 25/60 VUs  46.3s/50.0s

running (0m48.0s), 19/60 VUs, 1632 complete and 0 interrupted iterations
default   [  95% ] 19/60 VUs  47.3s/50.0s

running (0m49.0s), 11/60 VUs, 1672 complete and 0 interrupted iterations
default   [  97% ] 11/60 VUs  48.3s/50.0s

running (0m50.0s), 05/60 VUs, 1709 complete and 0 interrupted iterations
default   [  99% ] 05/60 VUs  49.3s/50.0s


  █ THRESHOLDS 

    http_req_duration{stage:ingress}
    ✗ 'p(95)<1200' p(95)=1.7s
    ✓ 'p(99)<1800' p(99)=1.75s

    http_req_failed{stage:ingress}
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3476    68.57004/s
    checks_succeeded...: 100.00% 3476 out of 3476
    checks_failed......: 0.00%   0 out of 3476

    ✓ organization created
    ✓ workflow created
    ✓ workflow version published
    ✓ warmup webhook accepted
    ✓ webhook accepted
    ✓ execution id returned

    HTTP
    http_req_duration..............: avg=1.07s min=28.94ms med=1.38s max=1.8s p(90)=1.68s p(95)=1.7s p(99)=1.75s
      { expected_response:true }...: avg=1.07s min=28.94ms med=1.38s max=1.8s p(90)=1.68s p(95)=1.7s p(99)=1.75s
      { stage:ingress }............: avg=1.08s min=28.94ms med=1.38s max=1.8s p(90)=1.68s p(95)=1.7s p(99)=1.75s
    http_req_failed................: 0.00%  0 out of 1740
      { stage:ingress }............: 0.00%  0 out of 1736
    http_reqs......................: 1740   34.324474/s

    EXECUTION
    iteration_duration.............: avg=1.08s min=29.08ms med=1.38s max=1.8s p(90)=1.68s p(95)=1.7s p(99)=1.75s
    iterations.....................: 1736   34.245567/s
    vus............................: 5      min=1         max=60
    vus_max........................: 60     min=60        max=60

    NETWORK
    data_received..................: 2.2 MB 44 kB/s
    data_sent......................: 800 kB 16 kB/s



running (0m50.7s), 00/60 VUs, 1736 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/60 VUs  50s

time="2026-07-01T00:23:17-03:00" level=error msg="thresholds on metrics 'http_req_duration{stage:ingress}' have been crossed"